-- Insert data
-- Insert city (Moscow)
INSERT INTO cities (id, name) VALUES 
(1, 'Москва')
ON CONFLICT (id) DO NOTHING;

-- Insert lines
INSERT INTO lines (id, name, hex_color, city_id) VALUES
('1', 'Сокольническая', 'E42313', 1),
('2', 'Замоскворецкая', '4FB04F', 1),
('3', 'Арбатско-Покровская', '0072BA', 1),
('4', 'Филевская', '1EBCEF', 1),
('5', 'Кольцевая', '915133', 1),
('6', 'Калужско-Рижская', 'F07E24', 1),
('7', 'Таганско-Краснопресненская', '943E90', 1),
('8', 'Калининская', 'FFCD1C', 1),
('9', 'Серпуховско-Тимирязевская', 'ADACAC', 1),
('10', 'Люблинско-Дмитровская', 'BED12C', 1),
('11', 'Каховская', '88CDCF', 1),
('12', 'Бутовская', 'BAC8E8', 1),
('95', 'МЦК', 'CC4C6E', 1),
('97', 'Большая кольцевая линия', '88CDCF', 1),
('98', 'Некрасовская', 'CC0066', 1),
('131', 'МЦД-1', 'F5A528', 1),
('132', 'МЦД-2', 'E74683', 1),
('133', 'Солнцевская', 'FFCD1C', 1),
('135', 'МЦД-3', 'EA5B04', 1),
('136', 'МЦД-4', '00CC66', 1),
('137', 'Троицкая', '03795F', 1)
ON CONFLICT (id) DO NOTHING;

-- Insert stations (grouped by line for better readability)
-- Line 1: Сокольническая
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('1.148', 'Бульвар Рокоссовского', ST_SetSRID(ST_MakePoint(37.732227, 55.814916), 4326), '1', 0),
('1.155', 'Черкизовская', ST_SetSRID(ST_MakePoint(37.744863, 55.802787), 4326), '1', 1),
('1.117', 'Преображенская площадь', ST_SetSRID(ST_MakePoint(37.713582, 55.796322), 4326), '1', 2),
('1.134', 'Сокольники', ST_SetSRID(ST_MakePoint(37.679895, 55.789282), 4326), '1', 3),
('1.60', 'Красносельская', ST_SetSRID(ST_MakePoint(37.666097, 55.780014), 4326), '1', 4),
('1.54', 'Комсомольская', ST_SetSRID(ST_MakePoint(37.654565, 55.774072), 4326), '1', 5),
('1.61', 'Красные ворота', ST_SetSRID(ST_MakePoint(37.6478, 55.768307), 4326), '1', 6),
('1.143', 'Чистые пруды', ST_SetSRID(ST_MakePoint(37.638293, 55.76499), 4326), '1', 7),
('1.66', 'Лубянка', ST_SetSRID(ST_MakePoint(37.625336, 55.759889), 4326), '1', 8),
('1.98', 'Охотный ряд', ST_SetSRID(ST_MakePoint(37.615078, 55.757228), 4326), '1', 9),
('1.4', 'Библиотека им.Ленина', ST_SetSRID(ST_MakePoint(37.610388, 55.752123), 4326), '1', 10),
('1.64', 'Кропоткинская', ST_SetSRID(ST_MakePoint(37.604217, 55.745297), 4326), '1', 11),
('1.103', 'Парк культуры', ST_SetSRID(ST_MakePoint(37.595027, 55.736163), 4326), '1', 12),
('1.152', 'Фрунзенская', ST_SetSRID(ST_MakePoint(37.58022, 55.727462), 4326), '1', 13),
('1.135', 'Спортивная', ST_SetSRID(ST_MakePoint(37.562041, 55.722388), 4326), '1', 14),
('1.165', 'Воробьевы горы', ST_SetSRID(ST_MakePoint(37.557293, 55.709169), 4326), '1', 15),
('1.149', 'Университет', ST_SetSRID(ST_MakePoint(37.534511, 55.69329), 4326), '1', 16),
('1.118', 'Проспект Вернадского', ST_SetSRID(ST_MakePoint(37.504584, 55.676549), 4326), '1', 17),
('1.162', 'Юго-Западная', ST_SetSRID(ST_MakePoint(37.482852, 55.663146), 4326), '1', 18),
('1.505', 'Тропарево', ST_SetSRID(ST_MakePoint(37.4725, 55.6459), 4326), '1', 19),
('1.513', 'Румянцево', ST_SetSRID(ST_MakePoint(37.4419, 55.633), 4326), '1', 20),
('1.514', 'Саларьево', ST_SetSRID(ST_MakePoint(37.424, 55.6227), 4326), '1', 21),
('1.678', 'Филатов луг', ST_SetSRID(ST_MakePoint(37.4075, 55.5997), 4326), '1', 22),
('1.679', 'Прокшино', ST_SetSRID(ST_MakePoint(37.4425, 55.5813), 4326), '1', 23),
('1.680', 'Ольховая', ST_SetSRID(ST_MakePoint(37.4589, 55.5692), 4326), '1', 24),
('1.681', 'Новомосковская (Коммунарка)', ST_SetSRID(ST_MakePoint(37.468716, 55.559765), 4326), '1', 25),
('1.919', 'Потапово', ST_SetSRID(ST_MakePoint(37.490978, 55.552538), 4326), '1', 26)
ON CONFLICT (id) DO NOTHING;

-- Line 2: Замоскворецкая
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('2.558', 'Ховрино', ST_SetSRID(ST_MakePoint(37.4877, 55.8777), 4326), '2', 0),
('2.674', 'Беломорская', ST_SetSRID(ST_MakePoint(37.4764, 55.8651), 4326), '2', 1),
('2.125', 'Речной вокзал', ST_SetSRID(ST_MakePoint(37.476728, 55.854152), 4326), '2', 2),
('2.29', 'Водный стадион', ST_SetSRID(ST_MakePoint(37.487515, 55.838978), 4326), '2', 3),
('2.30', 'Войковская', ST_SetSRID(ST_MakePoint(37.497791, 55.818923), 4326), '2', 4),
('2.133', 'Сокол', ST_SetSRID(ST_MakePoint(37.515245, 55.805564), 4326), '2', 5),
('2.12', 'Аэропорт', ST_SetSRID(ST_MakePoint(37.530477, 55.800441), 4326), '2', 6),
('2.34', 'Динамо', ST_SetSRID(ST_MakePoint(37.558212, 55.789704), 4326), '2', 7),
('2.19', 'Белорусская', ST_SetSRID(ST_MakePoint(37.582107, 55.777439), 4326), '2', 8),
('2.80', 'Маяковская', ST_SetSRID(ST_MakePoint(37.596192, 55.769808), 4326), '2', 9),
('2.122', 'Тверская', ST_SetSRID(ST_MakePoint(37.603918, 55.765343), 4326), '2', 10),
('2.99', 'Театральная', ST_SetSRID(ST_MakePoint(37.61768, 55.758808), 4326), '2', 11),
('2.89', 'Новокузнецкая', ST_SetSRID(ST_MakePoint(37.62928, 55.742391), 4326), '2', 12),
('2.101', 'Павелецкая', ST_SetSRID(ST_MakePoint(37.638693, 55.729741), 4326), '2', 13),
('2.2', 'Автозаводская', ST_SetSRID(ST_MakePoint(37.657008, 55.706634), 4326), '2', 14),
('2.512', 'Технопарк', ST_SetSRID(ST_MakePoint(37.664167, 55.695), 4326), '2', 15),
('2.53', 'Коломенская', ST_SetSRID(ST_MakePoint(37.663719, 55.677423), 4326), '2', 16),
('2.45', 'Каширская', ST_SetSRID(ST_MakePoint(37.649683, 55.655745), 4326), '2', 17),
('2.42', 'Кантемировская', ST_SetSRID(ST_MakePoint(37.656218, 55.636107), 4326), '2', 18),
('2.153', 'Царицыно', ST_SetSRID(ST_MakePoint(37.669612, 55.620982), 4326), '2', 19),
('2.96', 'Орехово', ST_SetSRID(ST_MakePoint(37.695214, 55.61269), 4326), '2', 20),
('2.38', 'Домодедовская', ST_SetSRID(ST_MakePoint(37.717111, 55.610131), 4326), '2', 21),
('2.57', 'Красногвардейская', ST_SetSRID(ST_MakePoint(37.742697, 55.614075), 4326), '2', 22),
('2.257', 'Алма-Атинская', ST_SetSRID(ST_MakePoint(37.765678, 55.63349), 4326), '2', 23)
ON CONFLICT (id) DO NOTHING;

-- Line 3: Арбатско-Покровская
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('3.159', 'Щелковская', ST_SetSRID(ST_MakePoint(37.798261, 55.809962), 4326), '3', 0),
('3.106', 'Первомайская', ST_SetSRID(ST_MakePoint(37.799364, 55.794376), 4326), '3', 1),
('3.40', 'Измайловская', ST_SetSRID(ST_MakePoint(37.779896, 55.787713), 4326), '3', 2),
('3.105', 'Партизанская', ST_SetSRID(ST_MakePoint(37.74882, 55.788401), 4326), '3', 3),
('3.130', 'Семеновская', ST_SetSRID(ST_MakePoint(37.719289, 55.783096), 4326), '3', 4),
('3.161', 'Электрозаводская', ST_SetSRID(ST_MakePoint(37.7053, 55.782057), 4326), '3', 5),
('3.17', 'Бауманская', ST_SetSRID(ST_MakePoint(37.67904, 55.772405), 4326), '3', 6),
('3.70', 'Курская', ST_SetSRID(ST_MakePoint(37.659039, 55.758564), 4326), '3', 7),
('3.100', 'Площадь Революции', ST_SetSRID(ST_MakePoint(37.62236, 55.756741), 4326), '3', 8),
('3.5', 'Арбатская', ST_SetSRID(ST_MakePoint(37.60349, 55.752312), 4326), '3', 9),
('3.131', 'Смоленская', ST_SetSRID(ST_MakePoint(37.583802, 55.747713), 4326), '3', 10),
('3.47', 'Киевская', ST_SetSRID(ST_MakePoint(37.564132, 55.743117), 4326), '3', 11),
('3.173', 'Парк Победы', ST_SetSRID(ST_MakePoint(37.516865, 55.735679), 4326), '3', 12),
('3.176', 'Славянский бульвар', ST_SetSRID(ST_MakePoint(37.470973, 55.729542), 4326), '3', 13),
('3.69', 'Кунцевская', ST_SetSRID(ST_MakePoint(37.446522, 55.730673), 4326), '3', 14),
('3.84', 'Молодежная', ST_SetSRID(ST_MakePoint(37.415627, 55.741375), 4326), '3', 15),
('3.65', 'Крылатское', ST_SetSRID(ST_MakePoint(37.408139, 55.756842), 4326), '3', 16),
('3.174', 'Строгино', ST_SetSRID(ST_MakePoint(37.402405, 55.803831), 4326), '3', 17),
('3.181', 'Мякинино', ST_SetSRID(ST_MakePoint(37.385214, 55.823342), 4326), '3', 18),
('3.182', 'Волоколамская', ST_SetSRID(ST_MakePoint(37.382453, 55.835154), 4326), '3', 19),
('3.183', 'Митино', ST_SetSRID(ST_MakePoint(37.36122, 55.846098), 4326), '3', 20),
('3.463', 'Пятницкое шоссе', ST_SetSRID(ST_MakePoint(37.353108, 55.853634), 4326), '3', 21)
ON CONFLICT (id) DO NOTHING;

-- Line 4: Филевская
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('4.471', 'Кунцевская', ST_SetSRID(ST_MakePoint(37.446754, 55.730815), 4326), '4', 0),
('4.110', 'Пионерская', ST_SetSRID(ST_MakePoint(37.466728, 55.736027), 4326), '4', 1),
('4.150', 'Филевский парк', ST_SetSRID(ST_MakePoint(37.483902, 55.739665), 4326), '4', 2),
('4.14', 'Багратионовская', ST_SetSRID(ST_MakePoint(37.497042, 55.743544), 4326), '4', 3),
('4.151', 'Фили', ST_SetSRID(ST_MakePoint(37.514035, 55.746763), 4326), '4', 4),
('4.73', 'Кутузовская', ST_SetSRID(ST_MakePoint(37.5341, 55.740544), 4326), '4', 5),
('4.136', 'Студенческая', ST_SetSRID(ST_MakePoint(37.54842, 55.738761), 4326), '4', 6),
('4.48', 'Киевская', ST_SetSRID(ST_MakePoint(37.565425, 55.743168), 4326), '4', 7),
('4.132', 'Смоленская', ST_SetSRID(ST_MakePoint(37.582173, 55.749083), 4326), '4', 8),
('4.11', 'Арбатская', ST_SetSRID(ST_MakePoint(37.601553, 55.752122), 4326), '4', 9),
('4.6', 'Александровский сад', ST_SetSRID(ST_MakePoint(37.608775, 55.752255), 4326), '4', 10),
('4.172', 'Деловой центр (Выставочная)', ST_SetSRID(ST_MakePoint(37.542641, 55.750243), 4326), '4', 11),
('4.179', 'Москва-Сити', ST_SetSRID(ST_MakePoint(37.532778, 55.748056), 4326), '4', 12)
ON CONFLICT (id) DO NOTHING;

-- Line 5: Кольцевая
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('5.82', 'Новослободская', ST_SetSRID(ST_MakePoint(37.601252, 55.779606), 4326), '5', 0),
('5.119', 'Проспект Мира', ST_SetSRID(ST_MakePoint(37.633646, 55.779584), 4326), '5', 1),
('5.55', 'Комсомольская', ST_SetSRID(ST_MakePoint(37.654772, 55.775672), 4326), '5', 2),
('5.71', 'Курская', ST_SetSRID(ST_MakePoint(37.661059, 55.758631), 4326), '5', 3),
('5.76', 'Таганская', ST_SetSRID(ST_MakePoint(37.653334, 55.742396), 4326), '5', 4),
('5.102', 'Павелецкая', ST_SetSRID(ST_MakePoint(37.636294, 55.731414), 4326), '5', 5),
('5.36', 'Добрынинская', ST_SetSRID(ST_MakePoint(37.622533, 55.728994), 4326), '5', 6),
('5.93', 'Октябрьская', ST_SetSRID(ST_MakePoint(37.611049, 55.729264), 4326), '5', 7),
('5.104', 'Парк культуры', ST_SetSRID(ST_MakePoint(37.593095, 55.735221), 4326), '5', 8),
('5.49', 'Киевская', ST_SetSRID(ST_MakePoint(37.56735, 55.74361), 4326), '5', 10),
('5.58', 'Краснопресненская', ST_SetSRID(ST_MakePoint(37.577114, 55.760378), 4326), '5', 11),
('5.20', 'Белорусская', ST_SetSRID(ST_MakePoint(37.582303, 55.775179), 4326), '5', 12)
ON CONFLICT (id) DO NOTHING;

-- Line 6: Калужско-Рижская
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('6.81', 'Медведково', ST_SetSRID(ST_MakePoint(37.661562, 55.888103), 4326), '6', 0),
('6.13', 'Бабушкинская', ST_SetSRID(ST_MakePoint(37.664341, 55.870641), 4326), '6', 1),
('6.129', 'Свиблово', ST_SetSRID(ST_MakePoint(37.653379, 55.855558), 4326), '6', 2),
('6.24', 'Ботанический сад', ST_SetSRID(ST_MakePoint(37.637811, 55.844597), 4326), '6', 3),
('6.27', 'ВДНХ', ST_SetSRID(ST_MakePoint(37.640751, 55.819626), 4326), '6', 4),
('6.8', 'Алексеевская', ST_SetSRID(ST_MakePoint(37.638699, 55.807794), 4326), '6', 5),
('6.126', 'Рижская', ST_SetSRID(ST_MakePoint(37.636114, 55.792494), 4326), '6', 6),
('6.120', 'Проспект Мира', ST_SetSRID(ST_MakePoint(37.633199, 55.781827), 4326), '6', 7),
('6.137', 'Сухаревская', ST_SetSRID(ST_MakePoint(37.63285, 55.772315), 4326), '6', 8),
('6.144', 'Тургеневская', ST_SetSRID(ST_MakePoint(37.636732, 55.765371), 4326), '6', 9),
('6.50', 'Китай-город', ST_SetSRID(ST_MakePoint(37.631326, 55.756498), 4326), '6', 10),
('6.90', 'Третьяковская', ST_SetSRID(ST_MakePoint(37.625624, 55.74073), 4326), '6', 11),
('6.94', 'Октябрьская', ST_SetSRID(ST_MakePoint(37.612851, 55.731232), 4326), '6', 12),
('6.157', 'Шаболовская', ST_SetSRID(ST_MakePoint(37.607892, 55.718828), 4326), '6', 13),
('6.74', 'Ленинский проспект', ST_SetSRID(ST_MakePoint(37.58499, 55.70678), 4326), '6', 14),
('6.3', 'Академическая', ST_SetSRID(ST_MakePoint(37.5723, 55.687147), 4326), '6', 15),
('6.121', 'Профсоюзная', ST_SetSRID(ST_MakePoint(37.562595, 55.677671), 4326), '6', 16),
('6.92', 'Новые Черемушки', ST_SetSRID(ST_MakePoint(37.554493, 55.670077), 4326), '6', 17),
('6.41', 'Калужская', ST_SetSRID(ST_MakePoint(37.540075, 55.656682), 4326), '6', 18),
('6.21', 'Беляево', ST_SetSRID(ST_MakePoint(37.526115, 55.642357), 4326), '6', 19),
('6.56', 'Коньково', ST_SetSRID(ST_MakePoint(37.519156, 55.631857), 4326), '6', 20),
('6.140', 'Теплый Стан', ST_SetSRID(ST_MakePoint(37.505912, 55.61873), 4326), '6', 21),
('6.164', 'Ясенево', ST_SetSRID(ST_MakePoint(37.5334, 55.606182), 4326), '6', 22),
('6.23', 'Новоясеневская', ST_SetSRID(ST_MakePoint(37.553017, 55.601947), 4326), '6', 23)
ON CONFLICT (id) DO NOTHING;

-- Line 7: Таганско-Краснопресненская
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('7.111', 'Планерная', ST_SetSRID(ST_MakePoint(37.436808, 55.859676), 4326), '7', 0),
('7.138', 'Сходненская', ST_SetSRID(ST_MakePoint(37.44076, 55.84926), 4326), '7', 1),
('7.145', 'Тушинская', ST_SetSRID(ST_MakePoint(37.437024, 55.825479), 4326), '7', 2),
('7.507', 'Спартак', ST_SetSRID(ST_MakePoint(37.4352, 55.8182), 4326), '7', 3),
('7.160', 'Щукинская', ST_SetSRID(ST_MakePoint(37.463241, 55.8094), 4326), '7', 4),
('7.95', 'Октябрьское поле', ST_SetSRID(ST_MakePoint(37.493317, 55.793581), 4326), '7', 5),
('7.114', 'Полежаевская', ST_SetSRID(ST_MakePoint(37.517895, 55.777201), 4326), '7', 6),
('7.18', 'Беговая', ST_SetSRID(ST_MakePoint(37.545518, 55.773505), 4326), '7', 7),
('7.146', 'Улица 1905 года', ST_SetSRID(ST_MakePoint(37.562271, 55.763944), 4326), '7', 8),
('7.16', 'Баррикадная', ST_SetSRID(ST_MakePoint(37.581242, 55.760793), 4326), '7', 9),
('7.124', 'Пушкинская', ST_SetSRID(ST_MakePoint(37.604356, 55.765607), 4326), '7', 10),
('7.67', 'Кузнецкий мост', ST_SetSRID(ST_MakePoint(37.624423, 55.761498), 4326), '7', 11),
('7.51', 'Китай-город', ST_SetSRID(ST_MakePoint(37.633877, 55.75436), 4326), '7', 12),
('7.77', 'Таганская', ST_SetSRID(ST_MakePoint(37.653605, 55.739502), 4326), '7', 13),
('7.62', 'Пролетарская', ST_SetSRID(ST_MakePoint(37.666917, 55.731546), 4326), '7', 14),
('7.31', 'Волгоградский проспект', ST_SetSRID(ST_MakePoint(37.685197, 55.725546), 4326), '7', 15),
('7.139', 'Текстильщики', ST_SetSRID(ST_MakePoint(37.732117, 55.709211), 4326), '7', 16),
('7.68', 'Кузьминки', ST_SetSRID(ST_MakePoint(37.763295, 55.705493), 4326), '7', 17),
('7.127', 'Рязанский проспект', ST_SetSRID(ST_MakePoint(37.792694, 55.716139), 4326), '7', 18),
('7.33', 'Выхино', ST_SetSRID(ST_MakePoint(37.816788, 55.715983), 4326), '7', 19),
('7.464', 'Лермонтовский проспект', ST_SetSRID(ST_MakePoint(37.851044, 55.702036), 4326), '7', 20),
('7.465', 'Жулебино', ST_SetSRID(ST_MakePoint(37.855833, 55.684722), 4326), '7', 21),
('7.508', 'Котельники', ST_SetSRID(ST_MakePoint(37.8582, 55.6743), 4326), '7', 22)
ON CONFLICT (id) DO NOTHING;

-- Line 8: Калининская
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('8.189', 'Новокосино', ST_SetSRID(ST_MakePoint(37.864052, 55.745113), 4326), '8', 0),
('8.88', 'Новогиреево', ST_SetSRID(ST_MakePoint(37.814587, 55.752237), 4326), '8', 1),
('8.107', 'Перово', ST_SetSRID(ST_MakePoint(37.78422, 55.75098), 4326), '8', 2),
('8.158', 'Шоссе Энтузиастов', ST_SetSRID(ST_MakePoint(37.751703, 55.75809), 4326), '8', 3),
('8.1', 'Авиамоторная', ST_SetSRID(ST_MakePoint(37.717444, 55.751933), 4326), '8', 4),
('8.112', 'Площадь Ильича', ST_SetSRID(ST_MakePoint(37.680726, 55.747115), 4326), '8', 5),
('8.78', 'Марксистская', ST_SetSRID(ST_MakePoint(37.65604, 55.740746), 4326), '8', 6),
('8.91', 'Третьяковская', ST_SetSRID(ST_MakePoint(37.626142, 55.741125), 4326), '8', 7)
ON CONFLICT (id) DO NOTHING;

-- Line 9: Серпуховско-Тимирязевская
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('9.9', 'Алтуфьево', ST_SetSRID(ST_MakePoint(37.586473, 55.899034), 4326), '9', 0),
('9.22', 'Бибирево', ST_SetSRID(ST_MakePoint(37.603011, 55.883868), 4326), '9', 1),
('9.97', 'Отрадное', ST_SetSRID(ST_MakePoint(37.605066, 55.864273), 4326), '9', 2),
('9.28', 'Владыкино', ST_SetSRID(ST_MakePoint(37.590451, 55.848236), 4326), '9', 3),
('9.108', 'Петровско-Разумовская', ST_SetSRID(ST_MakePoint(37.575512, 55.836565), 4326), '9', 4),
('9.141', 'Тимирязевская', ST_SetSRID(ST_MakePoint(37.574498, 55.81866), 4326), '9', 5),
('9.35', 'Дмитровская', ST_SetSRID(ST_MakePoint(37.581734, 55.808056), 4326), '9', 6),
('9.128', 'Савёловская', ST_SetSRID(ST_MakePoint(37.587163, 55.794054), 4326), '9', 7),
('9.83', 'Менделеевская', ST_SetSRID(ST_MakePoint(37.599141, 55.781999), 4326), '9', 8),
('9.154', 'Цветной бульвар', ST_SetSRID(ST_MakePoint(37.620466, 55.771653), 4326), '9', 9),
('9.123', 'Чеховская', ST_SetSRID(ST_MakePoint(37.608493, 55.765747), 4326), '9', 10),
('9.7', 'Боровицкая', ST_SetSRID(ST_MakePoint(37.60934, 55.750399), 4326), '9', 11),
('9.115', 'Полянка', ST_SetSRID(ST_MakePoint(37.618594, 55.736795), 4326), '9', 12),
('9.37', 'Серпуховская', ST_SetSRID(ST_MakePoint(37.624792, 55.726548), 4326), '9', 13),
('9.142', 'Тульская', ST_SetSRID(ST_MakePoint(37.622569, 55.70961), 4326), '9', 14),
('9.85', 'Нагатинская', ST_SetSRID(ST_MakePoint(37.620917, 55.682099), 4326), '9', 15),
('9.86', 'Нагорная', ST_SetSRID(ST_MakePoint(37.610397, 55.672962), 4326), '9', 16),
('9.87', 'Нахимовский проспект', ST_SetSRID(ST_MakePoint(37.605274, 55.662379), 4326), '9', 17),
('9.43', 'Севастопольская', ST_SetSRID(ST_MakePoint(37.59809, 55.651451), 4326), '9', 18),
('9.156', 'Чертановская', ST_SetSRID(ST_MakePoint(37.606065, 55.640538), 4326), '9', 19),
('9.163', 'Южная', ST_SetSRID(ST_MakePoint(37.609047, 55.622436), 4326), '9', 20),
('9.116', 'Пражская', ST_SetSRID(ST_MakePoint(37.602386, 55.610962), 4326), '9', 21),
('9.147', 'Улица Академика Янгеля', ST_SetSRID(ST_MakePoint(37.601498, 55.596753), 4326), '9', 22),
('9.10', 'Аннино', ST_SetSRID(ST_MakePoint(37.596999, 55.583477), 4326), '9', 23),
('9.170', 'Бульвар Дмитрия Донского', ST_SetSRID(ST_MakePoint(37.576856, 55.568201), 4326), '9', 24)
ON CONFLICT (id) DO NOTHING;

-- Line 10: Люблинско-Дмитровская
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('10.833', 'Физтех', ST_SetSRID(ST_MakePoint(37.546389, 55.921389), 4326), '10', 0),
('10.834', 'Лианозово', ST_SetSRID(ST_MakePoint(37.543611, 55.931111), 4326), '10', 1),
('10.835', 'Яхромская', ST_SetSRID(ST_MakePoint(37.545833, 55.8775), 4326), '10', 2),
('10.597', 'Селигерская', ST_SetSRID(ST_MakePoint(37.55005, 55.86483), 4326), '10', 3),
('10.598', 'Верхние Лихоборы', ST_SetSRID(ST_MakePoint(37.56282, 55.85566), 4326), '10', 4),
('10.596', 'Окружная', ST_SetSRID(ST_MakePoint(37.571111, 55.848889), 4326), '10', 5),
('10.548', 'Петровско-Разумовская', ST_SetSRID(ST_MakePoint(37.575556, 55.836667), 4326), '10', 6),
('10.547', 'Фонвизинская', ST_SetSRID(ST_MakePoint(37.588056, 55.822778), 4326), '10', 7),
('10.546', 'Бутырская', ST_SetSRID(ST_MakePoint(37.602778, 55.813333), 4326), '10', 8),
('10.185', 'Марьина Роща', ST_SetSRID(ST_MakePoint(37.61618, 55.793723), 4326), '10', 9),
('10.184', 'Достоевская', ST_SetSRID(ST_MakePoint(37.613889, 55.781667), 4326), '10', 10),
('10.177', 'Трубная', ST_SetSRID(ST_MakePoint(37.621926, 55.76771), 4326), '10', 11),
('10.175', 'Сретенский бульвар', ST_SetSRID(ST_MakePoint(37.635688, 55.766106), 4326), '10', 12),
('10.72', 'Чкаловская', ST_SetSRID(ST_MakePoint(37.659293, 55.755951), 4326), '10', 13),
('10.113', 'Римская', ST_SetSRID(ST_MakePoint(37.679996, 55.747027), 4326), '10', 14),
('10.63', 'Крестьянская застава', ST_SetSRID(ST_MakePoint(37.665325, 55.732278), 4326), '10', 15),
('10.39', 'Дубровка', ST_SetSRID(ST_MakePoint(37.676259, 55.71807), 4326), '10', 16),
('10.52', 'Кожуховская', ST_SetSRID(ST_MakePoint(37.68544, 55.706156), 4326), '10', 17),
('10.109', 'Печатники', ST_SetSRID(ST_MakePoint(37.728338, 55.692921), 4326), '10', 18),
('10.32', 'Волжская', ST_SetSRID(ST_MakePoint(37.754314, 55.690446), 4326), '10', 19),
('10.75', 'Люблино', ST_SetSRID(ST_MakePoint(37.761639, 55.676596), 4326), '10', 20),
('10.25', 'Братиславская', ST_SetSRID(ST_MakePoint(37.748415, 55.658817), 4326), '10', 21),
('10.79', 'Марьино', ST_SetSRID(ST_MakePoint(37.743844, 55.649158), 4326), '10', 22),
('10.187', 'Борисово', ST_SetSRID(ST_MakePoint(37.743333, 55.6325), 4326), '10', 23),
('10.188', 'Шипиловская', ST_SetSRID(ST_MakePoint(37.743611, 55.621667), 4326), '10', 24),
('10.186', 'Зябликово', ST_SetSRID(ST_MakePoint(37.745278, 55.611944), 4326), '10', 25)
ON CONFLICT (id) DO NOTHING;

-- Line 11: Каховская
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('11.46', 'Каширская', ST_SetSRID(ST_MakePoint(37.647705, 55.654327), 4326), '11', 0),
('11.26', 'Варшавская', ST_SetSRID(ST_MakePoint(37.619522, 55.653294), 4326), '11', 1),
('11.44', 'Каховская', ST_SetSRID(ST_MakePoint(37.596573, 55.652923), 4326), '11', 2)
ON CONFLICT (id) DO NOTHING;

-- Line 12: Бутовская
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('12.167', 'Бунинская аллея', ST_SetSRID(ST_MakePoint(37.515899, 55.537977), 4326), '12', 0),
('12.168', 'Улица Горчакова', ST_SetSRID(ST_MakePoint(37.532063, 55.542281), 4326), '12', 1),
('12.169', 'Бульвар Адмирала Ушакова', ST_SetSRID(ST_MakePoint(37.542329, 55.545207), 4326), '12', 2),
('12.166', 'Улица Скобелевская', ST_SetSRID(ST_MakePoint(37.552721, 55.548103), 4326), '12', 3),
('12.171', 'Улица Старокачаловская', ST_SetSRID(ST_MakePoint(37.576074, 55.569194), 4326), '12', 4),
('12.466', 'Лесопарковая', ST_SetSRID(ST_MakePoint(37.577816, 55.581656), 4326), '12', 5),
('12.467', 'Битцевский Парк', ST_SetSRID(ST_MakePoint(37.556058, 55.600066), 4326), '12', 6)
ON CONFLICT (id) DO NOTHING;

-- Line 95: МЦК
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('95.515', 'Окружная', ST_SetSRID(ST_MakePoint(37.571111, 55.848889), 4326), '95', 0),
('95.516', 'Владыкино', ST_SetSRID(ST_MakePoint(37.591944, 55.847222), 4326), '95', 1),
('95.517', 'Ботанический сад', ST_SetSRID(ST_MakePoint(37.640278, 55.845556), 4326), '95', 2),
('95.518', 'Ростокино', ST_SetSRID(ST_MakePoint(37.667778, 55.839444), 4326), '95', 3),
('95.519', 'Белокаменная', ST_SetSRID(ST_MakePoint(37.700556, 55.83), 4326), '95', 4),
('95.520', 'Бульвар Рокоссовского', ST_SetSRID(ST_MakePoint(37.736944, 55.817222), 4326), '95', 5),
('95.521', 'Локомотив', ST_SetSRID(ST_MakePoint(37.745742, 55.803219), 4326), '95', 6),
('95.522', 'Измайлово', ST_SetSRID(ST_MakePoint(37.742778, 55.788611), 4326), '95', 7),
('95.523', 'Соколиная Гора', ST_SetSRID(ST_MakePoint(37.745278, 55.77), 4326), '95', 8),
('95.524', 'Шоссе Энтузиастов', ST_SetSRID(ST_MakePoint(37.748477, 55.758633), 4326), '95', 9),
('95.525', 'Андроновка', ST_SetSRID(ST_MakePoint(37.734444, 55.741111), 4326), '95', 10),
('95.526', 'Нижегородская', ST_SetSRID(ST_MakePoint(37.72825, 55.732222), 4326), '95', 11),
('95.527', 'Новохохловская', ST_SetSRID(ST_MakePoint(37.716111, 55.723889), 4326), '95', 12),
('95.528', 'Угрешская', ST_SetSRID(ST_MakePoint(37.697778, 55.718333), 4326), '95', 13),
('95.529', 'Дубровка', ST_SetSRID(ST_MakePoint(37.677775, 55.71268), 4326), '95', 14),
('95.530', 'Автозаводская', ST_SetSRID(ST_MakePoint(37.66314, 55.70631), 4326), '95', 15),
('95.531', 'ЗИЛ', ST_SetSRID(ST_MakePoint(37.648333, 55.698333), 4326), '95', 16),
('95.532', 'Верхние Котлы', ST_SetSRID(ST_MakePoint(37.618889, 55.69), 4326), '95', 17),
('95.533', 'Крымская', ST_SetSRID(ST_MakePoint(37.605, 55.690038), 4326), '95', 18),
('95.534', 'Площадь Гагарина', ST_SetSRID(ST_MakePoint(37.585833, 55.706944), 4326), '95', 19),
('95.535', 'Лужники', ST_SetSRID(ST_MakePoint(37.563056, 55.720278), 4326), '95', 20),
('95.536', 'Кутузовская', ST_SetSRID(ST_MakePoint(37.533333, 55.740833), 4326), '95', 21),
('95.537', 'Деловой центр', ST_SetSRID(ST_MakePoint(37.532222, 55.747222), 4326), '95', 22),
('95.538', 'Шелепиха', ST_SetSRID(ST_MakePoint(37.525556, 55.7575), 4326), '95', 23),
('95.539', 'Хорошево', ST_SetSRID(ST_MakePoint(37.507222, 55.777222), 4326), '95', 24),
('95.540', 'Зорге', ST_SetSRID(ST_MakePoint(37.504444, 55.787778), 4326), '95', 25),
('95.541', 'Панфиловская', ST_SetSRID(ST_MakePoint(37.498889, 55.799167), 4326), '95', 26),
('95.542', 'Стрешнево', ST_SetSRID(ST_MakePoint(37.486944, 55.813611), 4326), '95', 27),
('95.543', 'Балтийская', ST_SetSRID(ST_MakePoint(37.496111, 55.825833), 4326), '95', 28),
('95.544', 'Коптево', ST_SetSRID(ST_MakePoint(37.520037, 55.839637), 4326), '95', 29),
('95.545', 'Лихоборы', ST_SetSRID(ST_MakePoint(37.551389, 55.847222), 4326), '95', 30)
ON CONFLICT (id) DO NOTHING;

-- Line 97: Большая кольцевая линия
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('97.813', 'Мичуринский проспект', ST_SetSRID(ST_MakePoint(37.485, 55.688333), 4326), '97', 0),
('97.814', 'Проспект Вернадского', ST_SetSRID(ST_MakePoint(37.505, 55.677778), 4326), '97', 1),
('97.815', 'Новаторская', ST_SetSRID(ST_MakePoint(37.52, 55.670833), 4326), '97', 2),
('97.816', 'Воронцовская', ST_SetSRID(ST_MakePoint(37.540833, 55.658333), 4326), '97', 3),
('97.817', 'Зюзино', ST_SetSRID(ST_MakePoint(37.575786, 55.655158), 4326), '97', 4),
('97.818', 'Каховская', ST_SetSRID(ST_MakePoint(37.598333, 55.653056), 4326), '97', 5),
('97.824', 'Варшавская', ST_SetSRID(ST_MakePoint(37.619444, 55.653333), 4326), '97', 6),
('97.832', 'Каширская', ST_SetSRID(ST_MakePoint(37.648611, 55.655), 4326), '97', 7),
('97.831', 'Кленовый бульвар', ST_SetSRID(ST_MakePoint(37.680833, 55.674444), 4326), '97', 8),
('97.830', 'Нагатинский Затон', ST_SetSRID(ST_MakePoint(37.703611, 55.684444), 4326), '97', 9),
('97.829', 'Печатники', ST_SetSRID(ST_MakePoint(37.7275, 55.694722), 4326), '97', 10),
('97.828', 'Текстильщики', ST_SetSRID(ST_MakePoint(37.728333, 55.708333), 4326), '97', 11),
('97.827', 'Нижегородская', ST_SetSRID(ST_MakePoint(37.728611, 55.7325), 4326), '97', 12),
('97.826', 'Авиамоторная', ST_SetSRID(ST_MakePoint(37.718611, 55.753056), 4326), '97', 13),
('97.825', 'Лефортово', ST_SetSRID(ST_MakePoint(37.702778, 55.764444), 4326), '97', 14),
('97.803', 'Электрозаводская', ST_SetSRID(ST_MakePoint(37.7053, 55.782057), 4326), '97', 15),
('97.823', 'Сокольники', ST_SetSRID(ST_MakePoint(37.678889, 55.791111), 4326), '97', 16),
('97.822', 'Рижская', ST_SetSRID(ST_MakePoint(37.633889, 55.792222), 4326), '97', 17),
('97.821', 'Марьина Роща', ST_SetSRID(ST_MakePoint(37.617222, 55.798333), 4326), '97', 18),
('97.685', 'Савёловская', ST_SetSRID(ST_MakePoint(37.587163, 55.794054), 4326), '97', 19),
('97.599', 'Петровский парк', ST_SetSRID(ST_MakePoint(37.55952, 55.79233), 4326), '97', 20),
('97.600', 'ЦСКА', ST_SetSRID(ST_MakePoint(37.53502, 55.78643), 4326), '97', 21),
('97.601', 'Хорошевская', ST_SetSRID(ST_MakePoint(37.51981, 55.77643), 4326), '97', 22),
('97.602', 'Шелепиха', ST_SetSRID(ST_MakePoint(37.52571, 55.75723), 4326), '97', 23),
('97.603', 'Деловой центр', ST_SetSRID(ST_MakePoint(37.5395, 55.7491), 4326), '97', 24),
('97.806', 'Народное Ополчение', ST_SetSRID(ST_MakePoint(37.485073, 55.77592), 4326), '97', 25),
('97.805', 'Мнёвники', ST_SetSRID(ST_MakePoint(37.47139, 55.761153), 4326), '97', 26),
('97.809', 'Терехово', ST_SetSRID(ST_MakePoint(37.459738, 55.748108), 4326), '97', 27),
('97.810', 'Кунцевская', ST_SetSRID(ST_MakePoint(37.445833, 55.730278), 4326), '97', 28),
('97.811', 'Давыдково', ST_SetSRID(ST_MakePoint(37.451667, 55.715278), 4326), '97', 29),
('97.812', 'Аминьевская', ST_SetSRID(ST_MakePoint(37.464167, 55.697222), 4326), '97', 30)
ON CONFLICT (id) DO NOTHING;

-- Line 98: Некрасовская
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('98.675', 'Косино', ST_SetSRID(ST_MakePoint(37.8511, 55.7026), 4326), '98', 0),
('98.676', 'Улица Дмитриевского', ST_SetSRID(ST_MakePoint(37.8792, 55.7093), 4326), '98', 1),
('98.677', 'Лухмановская', ST_SetSRID(ST_MakePoint(37.9004, 55.7078), 4326), '98', 2),
('98.641', 'Некрасовка', ST_SetSRID(ST_MakePoint(37.9264, 55.7029), 4326), '98', 3),
('98.762', 'Юго-Восточная', ST_SetSRID(ST_MakePoint(37.82, 55.71), 4326), '98', 4),
('98.763', 'Окская', ST_SetSRID(ST_MakePoint(37.77, 55.72), 4326), '98', 5),
('98.764', 'Стахановская', ST_SetSRID(ST_MakePoint(37.76, 55.73), 4326), '98', 6),
('98.765', 'Нижегородская', ST_SetSRID(ST_MakePoint(37.73, 55.73), 4326), '98', 7),
('98.800', 'Лефортово', ST_SetSRID(ST_MakePoint(37.702778, 55.764444), 4326), '98', 8),
('98.802', 'Электрозаводская', ST_SetSRID(ST_MakePoint(37.7053, 55.782057), 4326), '98', 9),
('98.804', 'Авиамоторная', ST_SetSRID(ST_MakePoint(37.717444, 55.751933), 4326), '98', 10)
ON CONFLICT (id) DO NOTHING;

-- Line 131: МЦД-1
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('131.687', 'Лобня', ST_SetSRID(ST_MakePoint(37.29057, 56.0048), 4326), '131', 0),
('131.688', 'Шереметьевская', ST_SetSRID(ST_MakePoint(37.498752, 55.983882), 4326), '131', 1),
('131.689', 'Хлебниково', ST_SetSRID(ST_MakePoint(37.504638, 55.970682), 4326), '131', 2),
('131.690', 'Водники', ST_SetSRID(ST_MakePoint(37.511143, 55.953419), 4326), '131', 3),
('131.691', 'Долгопрудная', ST_SetSRID(ST_MakePoint(37.520542, 55.938656), 4326), '131', 4),
('131.692', 'Новодачная', ST_SetSRID(ST_MakePoint(37.527877, 55.924459), 4326), '131', 5),
('131.693', 'Марк', ST_SetSRID(ST_MakePoint(37.538242, 55.904458), 4326), '131', 6),
('131.694', 'Лианозово', ST_SetSRID(ST_MakePoint(37.553261, 55.897316), 4326), '131', 7),
('131.695', 'Бескудниково', ST_SetSRID(ST_MakePoint(37.567768, 55.882713), 4326), '131', 8),
('131.696', 'Дегунино', ST_SetSRID(ST_MakePoint(37.573235, 55.86586), 4326), '131', 9),
('131.697', 'Окружная', ST_SetSRID(ST_MakePoint(37.571111, 55.848889), 4326), '131', 10),
('131.698', 'Тимирязевская', ST_SetSRID(ST_MakePoint(37.574498, 55.81866), 4326), '131', 11),
('131.699', 'Савёловская', ST_SetSRID(ST_MakePoint(37.587038, 55.793936), 4326), '131', 12),
('131.700', 'Белорусская', ST_SetSRID(ST_MakePoint(37.582303, 55.775179), 4326), '131', 13),
('131.701', 'Беговая', ST_SetSRID(ST_MakePoint(37.545518, 55.773505), 4326), '131', 14),
('131.702', 'Тестовская', ST_SetSRID(ST_MakePoint(37.531551, 55.754292), 4326), '131', 15),
('131.703', 'Фили', ST_SetSRID(ST_MakePoint(37.514526, 55.744263), 4326), '131', 16),
('131.801', 'Славянский бульвар', ST_SetSRID(ST_MakePoint(37.470556, 55.729722), 4326), '131', 17),
('131.704', 'Кунцевская', ST_SetSRID(ST_MakePoint(37.445591, 55.730554), 4326), '131', 18),
('131.705', 'Рабочий Посёлок', ST_SetSRID(ST_MakePoint(37.415577, 55.726957), 4326), '131', 19),
('131.706', 'Сетунь', ST_SetSRID(ST_MakePoint(37.397259, 55.723713), 4326), '131', 20),
('131.707', 'Немчиновка', ST_SetSRID(ST_MakePoint(37.374611, 55.715668), 4326), '131', 21),
('131.708', 'Сколково', ST_SetSRID(ST_MakePoint(37.424618, 55.666801), 4326), '131', 22),
('131.709', 'Баковка', ST_SetSRID(ST_MakePoint(37.315205, 55.682816), 4326), '131', 23),
('131.710', 'Одинцово', ST_SetSRID(ST_MakePoint(37.27773, 55.67798), 4326), '131', 24)
ON CONFLICT (id) DO NOTHING;

-- Line 132: МЦД-2
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('132.711', 'Нахабино', ST_SetSRID(ST_MakePoint(37.185204, 55.841522), 4326), '132', 0),
('132.712', 'Аникеевка', ST_SetSRID(ST_MakePoint(37.219829, 55.832099), 4326), '132', 1),
('132.713', 'Опалиха', ST_SetSRID(ST_MakePoint(37.246843, 55.82333), 4326), '132', 2),
('132.714', 'Красногорская', ST_SetSRID(ST_MakePoint(37.303337, 55.814571), 4326), '132', 3),
('132.715', 'Павшино', ST_SetSRID(ST_MakePoint(37.341461, 55.815231), 4326), '132', 4),
('132.716', 'Пенягино', ST_SetSRID(ST_MakePoint(37.361049, 55.822539), 4326), '132', 5),
('132.717', 'Волоколамская', ST_SetSRID(ST_MakePoint(37.382453, 55.835154), 4326), '132', 6),
('132.744', 'Трикотажная', ST_SetSRID(ST_MakePoint(37.398967, 55.833137), 4326), '132', 7),
('132.718', 'Тушинская', ST_SetSRID(ST_MakePoint(37.437024, 55.825479), 4326), '132', 8),
('132.719', 'Покровское-Стрешнево', ST_SetSRID(ST_MakePoint(37.47678, 55.814247), 4326), '132', 9),
('132.720', 'Стрешнево', ST_SetSRID(ST_MakePoint(37.486944, 55.813611), 4326), '132', 10),
('132.721', 'Красный Балтиец', ST_SetSRID(ST_MakePoint(37.526367, 55.815514), 4326), '132', 11),
('132.722', 'Гражданская', ST_SetSRID(ST_MakePoint(37.55315, 55.805527), 4326), '132', 12),
('132.723', 'Дмитровская', ST_SetSRID(ST_MakePoint(37.581734, 55.808056), 4326), '132', 13),
('132.724', 'Рижская', ST_SetSRID(ST_MakePoint(37.636114, 55.792494), 4326), '132', 14),
('132.725', 'Площадь трёх вокзалов', ST_SetSRID(ST_MakePoint(37.651861, 55.776087), 4326), '132', 15),
('132.726', 'Курская', ST_SetSRID(ST_MakePoint(37.660767, 55.757622), 4326), '132', 16),
('132.727', 'Москва Товарная', ST_SetSRID(ST_MakePoint(37.688839, 55.745358), 4326), '132', 17),
('132.728', 'Калитники', ST_SetSRID(ST_MakePoint(37.702203, 55.733981), 4326), '132', 18),
('132.729', 'Новохохловская', ST_SetSRID(ST_MakePoint(37.719236, 55.718523), 4326), '132', 19),
('132.730', 'Текстильщики', ST_SetSRID(ST_MakePoint(37.731283, 55.708934), 4326), '132', 20),
('132.731', 'Люблино', ST_SetSRID(ST_MakePoint(37.761639, 55.676596), 4326), '132', 21),
('132.732', 'Депо', ST_SetSRID(ST_MakePoint(37.728446, 55.674257), 4326), '132', 22),
('132.733', 'Перерва', ST_SetSRID(ST_MakePoint(37.716278, 55.660809), 4326), '132', 23),
('132.807', 'Курьяново', ST_SetSRID(ST_MakePoint(37.701667, 55.649722), 4326), '132', 24),
('132.734', 'Москворечье', ST_SetSRID(ST_MakePoint(37.689789, 55.641239), 4326), '132', 25),
('132.735', 'Царицыно', ST_SetSRID(ST_MakePoint(37.668846, 55.618309), 4326), '132', 26),
('132.736', 'Покровское', ST_SetSRID(ST_MakePoint(37.47678, 55.814247), 4326), '132', 27),
('132.737', 'Красный строитель', ST_SetSRID(ST_MakePoint(37.615093, 55.589455), 4326), '132', 28),
('132.738', 'Битца', ST_SetSRID(ST_MakePoint(37.611443, 55.571186), 4326), '132', 29),
('132.739', 'Бутово', ST_SetSRID(ST_MakePoint(37.555668, 55.548279), 4326), '132', 30),
('132.740', 'Щербинка', ST_SetSRID(ST_MakePoint(37.562008, 55.509724), 4326), '132', 31),
('132.741', 'Остафьево', ST_SetSRID(ST_MakePoint(37.520055, 55.50337), 4326), '132', 32),
('132.742', 'Силикатная', ST_SetSRID(ST_MakePoint(37.555278, 55.470278), 4326), '132', 33),
('132.743', 'Подольск', ST_SetSRID(ST_MakePoint(37.565, 55.431667), 4326), '132', 34),
('132.917', 'Марьина Роща', ST_SetSRID(ST_MakePoint(37.618889, 55.800833), 4326), '132', 35)
ON CONFLICT (id) DO NOTHING;

-- Вставка станций для линии МЦД-3
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('135.836', 'Крюково', ST_SetSRID(ST_MakePoint(37.173611, 55.979722), 4326), '135', 0),
('135.837', 'Малино', ST_SetSRID(ST_MakePoint(37.211667, 55.969167), 4326), '135', 1),
('135.838', 'Фирсановская', ST_SetSRID(ST_MakePoint(37.251111, 55.960278), 4326), '135', 2),
('135.839', 'Сходня', ST_SetSRID(ST_MakePoint(37.298611, 55.949722), 4326), '135', 3),
('135.840', 'Подрезково', ST_SetSRID(ST_MakePoint(37.334722, 55.941667), 4326), '135', 4),
('135.841', 'Новоподрезково', ST_SetSRID(ST_MakePoint(37.351667, 55.936389), 4326), '135', 5),
('135.842', 'Молжаниново', ST_SetSRID(ST_MakePoint(37.380833, 55.924167), 4326), '135', 6),
('135.843', 'Химки', ST_SetSRID(ST_MakePoint(37.450833, 55.894444), 4326), '135', 7),
('135.844', 'Левобережная', ST_SetSRID(ST_MakePoint(37.468611, 55.886944), 4326), '135', 8),
('135.845', 'Ховрино', ST_SetSRID(ST_MakePoint(37.486667, 55.879444), 4326), '135', 9),
('135.846', 'Грачёвская', ST_SetSRID(ST_MakePoint(37.509167, 55.869444), 4326), '135', 10),
('135.847', 'Моссельмаш', ST_SetSRID(ST_MakePoint(37.526389, 55.862222), 4326), '135', 11),
('135.848', 'Лихоборы', ST_SetSRID(ST_MakePoint(37.5525, 55.85), 4326), '135', 12),
('135.849', 'Петровско-Разумовская', ST_SetSRID(ST_MakePoint(37.568333, 55.839722), 4326), '135', 13),
('135.850', 'Останкино', ST_SetSRID(ST_MakePoint(37.603611, 55.817222), 4326), '135', 14),
('135.851', 'Рижская', ST_SetSRID(ST_MakePoint(37.639167, 55.796944), 4326), '135', 15),
('135.852', 'Митьково', ST_SetSRID(ST_MakePoint(37.6675, 55.786389), 4326), '135', 16),
('135.853', 'Электрозаводская', ST_SetSRID(ST_MakePoint(37.705278, 55.781111), 4326), '135', 17),
('135.854', 'Сортировочная', ST_SetSRID(ST_MakePoint(37.720833, 55.763611), 4326), '135', 18),
('135.855', 'Авиамоторная', ST_SetSRID(ST_MakePoint(37.721944, 55.750278), 4326), '135', 19),
('135.856', 'Андроновка', ST_SetSRID(ST_MakePoint(37.741111, 55.744444), 4326), '135', 20),
('135.857', 'Перово', ST_SetSRID(ST_MakePoint(37.765, 55.735556), 4326), '135', 21),
('135.858', 'Плющево', ST_SetSRID(ST_MakePoint(37.774167, 55.730556), 4326), '135', 22),
('135.859', 'Вешняки', ST_SetSRID(ST_MakePoint(37.799167, 55.721944), 4326), '135', 23),
('135.860', 'Выхино', ST_SetSRID(ST_MakePoint(37.815911, 55.716575), 4326), '135', 24),
('135.861', 'Косино', ST_SetSRID(ST_MakePoint(37.8475, 55.714167), 4326), '135', 25),
('135.862', 'Ухтомская', ST_SetSRID(ST_MakePoint(37.864167, 55.698611), 4326), '135', 26),
('135.863', 'Люберцы I', ST_SetSRID(ST_MakePoint(37.896944, 55.681667), 4326), '135', 27),
('135.864', 'Панки', ST_SetSRID(ST_MakePoint(37.9225, 55.668889), 4326), '135', 28),
('135.865', 'Томилино', ST_SetSRID(ST_MakePoint(37.954722, 55.655), 4326), '135', 29),
('135.866', 'Красково', ST_SetSRID(ST_MakePoint(37.9825, 55.649722), 4326), '135', 30),
('135.867', 'Малаховка', ST_SetSRID(ST_MakePoint(38.008333, 55.645), 4326), '135', 31),
('135.868', 'Удельная', ST_SetSRID(ST_MakePoint(38.043889, 55.634444), 4326), '135', 32),
('135.869', 'Быково', ST_SetSRID(ST_MakePoint(38.070556, 55.626667), 4326), '135', 33),
('135.870', 'Ильинская', ST_SetSRID(ST_MakePoint(38.100278, 55.616389), 4326), '135', 34),
('135.871', 'Отдых', ST_SetSRID(ST_MakePoint(38.136944, 55.601111), 4326), '135', 35),
('135.872', 'Кратово', ST_SetSRID(ST_MakePoint(38.16, 55.591667), 4326), '135', 36),
('135.873', 'Есенинская', ST_SetSRID(ST_MakePoint(38.184167, 55.581944), 4326), '135', 37),
('135.874', 'Фабричная', ST_SetSRID(ST_MakePoint(1.873333, 55.572778), 4326), '135', 38),
('135.875', 'Раменское', ST_SetSRID(ST_MakePoint(55.565278, 55.565278), 4326), '135', 39),
('135.876', 'Ипподром', ST_SetSRID(ST_MakePoint(38.238889, 55.560278), 4326), '135', 40);

-- Вставка станций для линии МЦД-4
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('136.877', 'Железнодорожная', ST_SetSRID(ST_MakePoint(38.008889, 55.7525), 4326), '136', 0),
('136.878', 'Ольгино', ST_SetSRID(ST_MakePoint(37.978611, 55.751667), 4326), '136', 1),
('136.879', 'Кучино', ST_SetSRID(ST_MakePoint(37.954722, 55.752222), 4326), '136', 2),
('136.880', 'Салтыковская', ST_SetSRID(ST_MakePoint(37.923056, 55.757778), 4326), '136', 3),
('136.881', 'Никольское', ST_SetSRID(ST_MakePoint(37.897778, 55.759722), 4326), '136', 4),
('136.882', 'Реутов', ST_SetSRID(ST_MakePoint(37.855833, 55.751389), 4326), '136', 5),
('136.883', 'Новогиреево', ST_SetSRID(ST_MakePoint(37.818333, 55.744444), 4326), '136', 6),
('136.884', 'Кусково', ST_SetSRID(ST_MakePoint(37.795278, 55.739722), 4326), '136', 7),
('136.886', 'Чухлинка', ST_SetSRID(ST_MakePoint(55.733889, 55.733889), 4326), '136', 8),
('136.887', 'Нижегородская', ST_SetSRID(ST_MakePoint(37.729444, 55.733333), 4326), '136', 9),
('136.888', 'Серп и Молот', ST_SetSRID(ST_MakePoint(37.681944, 55.748056), 4326), '136', 10),
('136.889', 'Курская', ST_SetSRID(ST_MakePoint(37.660556, 55.740833), 4326), '136', 11),
('136.890', 'Площадь трёх вокзалов', ST_SetSRID(ST_MakePoint(37.651111, 55.776667), 4326), '136', 12),
('136.891', 'Рижская', ST_SetSRID(ST_MakePoint(37.638611, 55.793889), 4326), '136', 13),
('136.892', 'Марьина Роща', ST_SetSRID(ST_MakePoint(37.618889, 55.800833), 4326), '136', 14),
('136.893', 'Савёловская', ST_SetSRID(ST_MakePoint(37.590278, 55.794444), 4326), '136', 15),
('136.894', 'Белорусская', ST_SetSRID(ST_MakePoint(37.580278, 55.776389), 4326), '136', 16),
('136.896', 'Ермакова Роща', ST_SetSRID(ST_MakePoint(37.535278, 55.765556), 4326), '136', 18),
('136.897', 'Тестовская', ST_SetSRID(ST_MakePoint(37.530278, 55.750833), 4326), '136', 19),
('136.898', 'Кутузовская', ST_SetSRID(ST_MakePoint(37.533056, 55.741944), 4326), '136', 20),
('136.899', 'Поклонная', ST_SetSRID(ST_MakePoint(37.511667, 55.728333), 4326), '136', 21),
('136.900', 'Минская', ST_SetSRID(ST_MakePoint(37.533056, 55.723333), 4326), '136', 22),
('136.901', 'Матвеевское', ST_SetSRID(ST_MakePoint(37.482222, 55.704722), 4326), '136', 23),
('136.902', 'Аминьевская', ST_SetSRID(ST_MakePoint(37.468056, 55.699444), 4326), '136', 24),
('136.903', 'Очаково I', ST_SetSRID(ST_MakePoint(37.451389, 55.683611), 4326), '136', 25),
('136.904', 'Мещерская', ST_SetSRID(ST_MakePoint(37.424444, 55.666667), 4326), '136', 26),
('136.905', 'Солнечная', ST_SetSRID(ST_MakePoint(37.383611, 55.656944), 4326), '136', 27),
('136.906', 'Новопеределкино', ST_SetSRID(ST_MakePoint(37.381111, 55.639167), 4326), '136', 28),
('136.907', 'Переделкино', ST_SetSRID(ST_MakePoint(37.353889, 55.656111), 4326), '136', 29),
('136.908', 'Мичуринец', ST_SetSRID(ST_MakePoint(37.315, 55.646111), 4326), '136', 30),
('136.909', 'Внуково', ST_SetSRID(ST_MakePoint(37.269722, 55.648889), 4326), '136', 31),
('136.910', 'Лесной Городок', ST_SetSRID(ST_MakePoint(37.219167, 55.630278), 4326), '136', 32),
('136.911', 'Толстопальцево', ST_SetSRID(ST_MakePoint(37.186389, 55.607778), 4326), '136', 33),
('136.912', 'Кокошкино', ST_SetSRID(ST_MakePoint(37.171389, 55.599722), 4326), '136', 34),
('136.913', 'Санино', ST_SetSRID(ST_MakePoint(37.138333, 55.583889), 4326), '136', 35),
('136.914', 'Крёкшино', ST_SetSRID(ST_MakePoint(37.109722, 55.577778), 4326), '136', 36),
('136.915', 'Победа', ST_SetSRID(ST_MakePoint(37.093056, 55.566111), 4326), '136', 37),
('136.916', 'Апрелевка', ST_SetSRID(ST_MakePoint(37.0675, 55.550278), 4326), '136', 38);

-- Вставка станций для линии Троицкая
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('137.921', 'Новаторская', ST_SetSRID(ST_MakePoint(37.52, 55.670833), 4326), '137', 0),
('137.920', 'Университет дружбы народов', ST_SetSRID(ST_MakePoint(37.507556, 55.64824), 4326), '137', 1),
('137.922', 'Генерала Тюленева', ST_SetSRID(ST_MakePoint(37.486032, 55.626248), 4326), '137', 2),
('137.923', 'Тютчевская', ST_SetSRID(ST_MakePoint(37.481415, 55.618801), 4326), '137', 3),
('137.928', 'Корниловская', ST_SetSRID(ST_MakePoint(37.479586, 55.599411), 4326), '137', 4),
('137.929', 'Коммунарка', ST_SetSRID(ST_MakePoint(37.468116, 55.57354), 4326), '137', 5),
('137.930', 'Новомосковская', ST_SetSRID(ST_MakePoint(37.469807, 55.560094), 4326), '137', 6);

-- Вставка станций для линии Солнцевская
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('133.468', 'Деловой центр', ST_SetSRID(ST_MakePoint(37.5395, 55.7491), 4326), '133', 0),
('133.885', 'Пыхтино', ST_SetSRID(ST_MakePoint(37.298056, 55.625), 4326), '133', 1),
('133.470', 'Парк Победы', ST_SetSRID(ST_MakePoint(37.514401, 55.736478), 4326), '133', 2),
('133.555', 'Минская', ST_SetSRID(ST_MakePoint(37.5038, 55.7232), 4326), '133', 3),
('133.556', 'Ломоносовский проспект', ST_SetSRID(ST_MakePoint(37.5225, 55.7055), 4326), '133', 4),
('133.557', 'Раменки', ST_SetSRID(ST_MakePoint(37.505, 55.6961), 4326), '133', 5),
('133.607', 'Мичуринский проспект', ST_SetSRID(ST_MakePoint(37.485, 55.6888), 4326), '133', 6),
('133.608', 'Озёрная', ST_SetSRID(ST_MakePoint(37.4495, 55.6698), 4326), '133', 7),
('133.609', 'Говорово', ST_SetSRID(ST_MakePoint(37.4174, 55.6588), 4326), '133', 8),
('133.610', 'Солнцево', ST_SetSRID(ST_MakePoint(37.3911, 55.649), 4326), '133', 9),
('133.611', 'Боровское шоссе', ST_SetSRID(ST_MakePoint(37.3701, 55.647), 4326), '133', 10),
('133.612', 'Новопеределкино', ST_SetSRID(ST_MakePoint(37.3544, 55.6385), 4326), '133', 11),
('133.613', 'Рассказовка', ST_SetSRID(ST_MakePoint(37.3328, 55.6324), 4326), '133', 12),
('133.918', 'Аэропорт Внуково', ST_SetSRID(ST_MakePoint(37.288333, 55.606667), 4326), '133', 13);





-- Вставка города Санкт-Петербург
INSERT INTO cities (id, name) 
VALUES (2, 'Санкт-Петербург')
ON CONFLICT (id) DO NOTHING;

-- Вставка линии Кировско-Выборгская
INSERT INTO lines (id, name, hex_color, city_id) 
VALUES ('14', 'Кировско-Выборгская', 'D6083B', 2)
ON CONFLICT (id) DO NOTHING;

-- Вставка станций Кировско-Выборгской линии
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('14.190', 'Девяткино', ST_SetSRID(ST_MakePoint(30.443045, 60.050182), 4326), '14', 0),
('14.191', 'Гражданский проспект', ST_SetSRID(ST_MakePoint(30.418224, 60.034969), 4326), '14', 1),
('14.192', 'Академическая', ST_SetSRID(ST_MakePoint(30.396044, 60.012806), 4326), '14', 2),
('14.193', 'Политехническая', ST_SetSRID(ST_MakePoint(30.370907, 60.008942), 4326), '14', 3),
('14.194', 'Площадь Мужества', ST_SetSRID(ST_MakePoint(30.366159, 59.999828), 4326), '14', 4),
('14.195', 'Лесная', ST_SetSRID(ST_MakePoint(30.344259, 59.984947), 4326), '14', 5),
('14.196', 'Выборгская', ST_SetSRID(ST_MakePoint(30.347408, 59.970925), 4326), '14', 6),
('14.197', 'Площадь Ленина', ST_SetSRID(ST_MakePoint(30.35605, 59.955611), 4326), '14', 7),
('14.198', 'Чернышевская', ST_SetSRID(ST_MakePoint(30.359919, 59.94453), 4326), '14', 8),
('14.199', 'Площадь Восстания', ST_SetSRID(ST_MakePoint(30.361069, 59.930279), 4326), '14', 9),
('14.200', 'Владимирская', ST_SetSRID(ST_MakePoint(30.347898, 59.927628), 4326), '14', 10),
('14.201', 'Пушкинская', ST_SetSRID(ST_MakePoint(30.329599, 59.92065), 4326), '14', 11),
('14.202', 'Технологический институт 1', ST_SetSRID(ST_MakePoint(30.318485, 59.916512), 4326), '14', 12),
('14.203', 'Балтийская', ST_SetSRID(ST_MakePoint(30.299578, 59.907211), 4326), '14', 13),
('14.204', 'Нарвская', ST_SetSRID(ST_MakePoint(30.274908, 59.901218), 4326), '14', 14),
('14.205', 'Кировский завод', ST_SetSRID(ST_MakePoint(30.261921, 59.879688), 4326), '14', 15),
('14.206', 'Автово', ST_SetSRID(ST_MakePoint(30.261337, 59.867325), 4326), '14', 16),
('14.207', 'Ленинский проспект', ST_SetSRID(ST_MakePoint(30.268274, 59.85117), 4326), '14', 17),
('14.208', 'Проспект Ветеранов', ST_SetSRID(ST_MakePoint(30.250588, 59.84211), 4326), '14', 18);

-- Вставка линии Московско-Петроградская
INSERT INTO lines (id, name, hex_color, city_id) 
VALUES ('15', 'Московско-Петроградская', '0078C9', 2)
ON CONFLICT (id) DO NOTHING;

-- Вставка станций Московско-Петроградской линии
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('15.209', 'Парнас', ST_SetSRID(ST_MakePoint(30.333839, 60.06699), 4326), '15', 0),
('15.210', 'Проспект Просвещения', ST_SetSRID(ST_MakePoint(30.332544, 60.051456), 4326), '15', 1),
('15.211', 'Озерки', ST_SetSRID(ST_MakePoint(30.321495, 60.037098), 4326), '15', 2),
('15.212', 'Удельная', ST_SetSRID(ST_MakePoint(30.315607, 60.016697), 4326), '15', 3),
('15.213', 'Пионерская', ST_SetSRID(ST_MakePoint(30.296759, 60.002487), 4326), '15', 4),
('15.214', 'Чёрная речка', ST_SetSRID(ST_MakePoint(30.300833, 59.985455), 4326), '15', 5),
('15.215', 'Петроградская', ST_SetSRID(ST_MakePoint(30.311293, 59.966389), 4326), '15', 6),
('15.216', 'Горьковская', ST_SetSRID(ST_MakePoint(30.31889, 59.956112), 4326), '15', 7),
('15.217', 'Невский проспект', ST_SetSRID(ST_MakePoint(30.327052, 59.935421), 4326), '15', 8),
('15.218', 'Сенная площадь', ST_SetSRID(ST_MakePoint(30.320316, 59.927135), 4326), '15', 9),
('15.219', 'Технологический институт 2', ST_SetSRID(ST_MakePoint(30.318485, 59.916512), 4326), '15', 10),
('15.220', 'Фрунзенская', ST_SetSRID(ST_MakePoint(30.31745, 59.906273), 4326), '15', 11),
('15.221', 'Московские ворота', ST_SetSRID(ST_MakePoint(30.317873, 59.891788), 4326), '15', 12),
('15.222', 'Электросила', ST_SetSRID(ST_MakePoint(30.318659, 59.879189), 4326), '15', 13),
('15.223', 'Парк Победы', ST_SetSRID(ST_MakePoint(30.321802, 59.866344), 4326), '15', 14),
('15.224', 'Московская', ST_SetSRID(ST_MakePoint(30.321483, 59.848873), 4326), '15', 15),
('15.225', 'Звёздная', ST_SetSRID(ST_MakePoint(30.349428, 59.833241), 4326), '15', 16),
('15.226', 'Купчино', ST_SetSRID(ST_MakePoint(30.375702, 59.829781), 4326), '15', 17);

-- Вставка линии Невско-Василеостровская
INSERT INTO lines (id, name, hex_color, city_id) 
VALUES ('16', 'Невско-Василеостровская', '009A49', 2)
ON CONFLICT (id) DO NOTHING;

-- Вставка станций Невско-Василеостровской линии
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('16.604', 'Беговая', ST_SetSRID(ST_MakePoint(30.20247, 59.98723), 4326), '16', 0),
('16.808', 'Зенит', ST_SetSRID(ST_MakePoint(30.211667, 59.972222), 4326), '16', 1),
('16.227', 'Приморская', ST_SetSRID(ST_MakePoint(30.23447, 59.948521), 4326), '16', 2),
('16.228', 'Василеостровская', ST_SetSRID(ST_MakePoint(30.278254, 59.942577), 4326), '16', 3),
('16.229', 'Гостиный двор', ST_SetSRID(ST_MakePoint(30.33341, 59.933933), 4326), '16', 4),
('16.230', 'Маяковская', ST_SetSRID(ST_MakePoint(30.354645, 59.931366), 4326), '16', 5),
('16.231', 'Площадь Александра Невского 1', ST_SetSRID(ST_MakePoint(30.384989, 59.924369), 4326), '16', 6),
('16.232', 'Елизаровская', ST_SetSRID(ST_MakePoint(30.423656, 59.89669), 4326), '16', 7),
('16.233', 'Ломоносовская', ST_SetSRID(ST_MakePoint(30.441715, 59.877342), 4326), '16', 8),
('16.234', 'Пролетарская', ST_SetSRID(ST_MakePoint(30.47, 59.865), 4326), '16', 9),
('16.235', 'Обухово', ST_SetSRID(ST_MakePoint(30.457743, 59.848709), 4326), '16', 10),
('16.236', 'Рыбацкое', ST_SetSRID(ST_MakePoint(30.501259, 59.830986), 4326), '16', 11);

-- Вставка линии Лахтинско-Правобережная
INSERT INTO lines (id, name, hex_color, city_id) 
VALUES ('17', 'Лахтинско-Правобережная', 'EA7125', 2)
ON CONFLICT (id) DO NOTHING;

-- Вставка станций Лахтинско-Правобережной линии
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('17.924', 'Горный институт', ST_SetSRID(ST_MakePoint(30.262667, 59.931749), 4326), '17', 0),
('17.237', 'Спасская', ST_SetSRID(ST_MakePoint(30.320316, 59.927135), 4326), '17', 1),
('17.238', 'Достоевская', ST_SetSRID(ST_MakePoint(30.346029, 59.928234), 4326), '17', 2),
('17.239', 'Лиговский проспект', ST_SetSRID(ST_MakePoint(30.355055, 59.920811), 4326), '17', 3),
('17.240', 'Площадь Александра Невского 2', ST_SetSRID(ST_MakePoint(30.383421, 59.923563), 4326), '17', 4),
('17.241', 'Новочеркасская', ST_SetSRID(ST_MakePoint(30.411915, 59.929092), 4326), '17', 5),
('17.242', 'Ладожская', ST_SetSRID(ST_MakePoint(30.439274, 59.93243), 4326), '17', 6),
('17.243', 'Проспект Большевиков', ST_SetSRID(ST_MakePoint(30.466757, 59.919838), 4326), '17', 7),
('17.244', 'Улица Дыбенко', ST_SetSRID(ST_MakePoint(30.483311, 59.907417), 4326), '17', 8);

-- Вставка линии Фрунзенско-Приморская
INSERT INTO lines (id, name, hex_color, city_id) 
VALUES ('18', 'Фрунзенско-Приморская', '702785', 2)
ON CONFLICT (id) DO NOTHING;

-- Вставка станций Фрунзенско-Приморской линии
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('18.245', 'Комендантский проспект', ST_SetSRID(ST_MakePoint(30.258663, 60.008591), 4326), '18', 0),
('18.246', 'Старая Деревня', ST_SetSRID(ST_MakePoint(30.255163, 59.989433), 4326), '18', 1),
('18.247', 'Крестовский остров', ST_SetSRID(ST_MakePoint(30.259436, 59.971821), 4326), '18', 2),
('18.248', 'Чкаловская', ST_SetSRID(ST_MakePoint(30.292006, 59.961033), 4326), '18', 3),
('18.249', 'Спортивная', ST_SetSRID(ST_MakePoint(30.291338, 59.952026), 4326), '18', 4),
('18.258', 'Адмиралтейская', ST_SetSRID(ST_MakePoint(30.31523, 59.935867), 4326), '18', 5),
('18.250', 'Садовая', ST_SetSRID(ST_MakePoint(30.317753, 59.926739), 4326), '18', 6),
('18.251', 'Звенигородская', ST_SetSRID(ST_MakePoint(30.329599, 59.92065), 4326), '18', 7),
('18.252', 'Обводный Канал', ST_SetSRID(ST_MakePoint(30.34815, 59.914686), 4326), '18', 8),
('18.253', 'Волковская', ST_SetSRID(ST_MakePoint(30.35754, 59.896023), 4326), '18', 9),
('18.259', 'Бухарестская', ST_SetSRID(ST_MakePoint(30.368932, 59.883769), 4326), '18', 10),
('18.260', 'Международная', ST_SetSRID(ST_MakePoint(30.379289, 59.870203), 4326), '18', 11),
('18.682', 'Дунайская', ST_SetSRID(ST_MakePoint(30.410667, 59.839889), 4326), '18', 12),
('18.683', 'Проспект Славы', ST_SetSRID(ST_MakePoint(30.395402, 59.856704), 4326), '18', 13),
('18.684', 'Шушары', ST_SetSRID(ST_MakePoint(30.432718, 59.819973), 4326), '18', 14);






-- Вставка города Екатеринбург
INSERT INTO cities (id, name) 
VALUES (3, 'Екатеринбург')
ON CONFLICT (id) DO NOTHING;

-- Вставка линии Север-Юг
INSERT INTO lines (id, name, hex_color, city_id) 
VALUES ('48', 'Север-Юг', '0A6F20', 3)
ON CONFLICT (id) DO NOTHING;

-- Вставка станций линии Север-Юг
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('48.261', 'Проспект Космонавтов', ST_SetSRID(ST_MakePoint(60.613878, 56.900393), 4326), '48', 0),
('48.262', 'Уралмаш', ST_SetSRID(ST_MakePoint(60.614165, 56.887674), 4326), '48', 1),
('48.263', 'Машиностроителей', ST_SetSRID(ST_MakePoint(60.61218, 56.878517), 4326), '48', 2),
('48.264', 'Уральская', ST_SetSRID(ST_MakePoint(60.600816, 56.858056), 4326), '48', 3),
('48.265', 'Динамо', ST_SetSRID(ST_MakePoint(60.599406, 56.847818), 4326), '48', 4),
('48.266', 'Площадь 1905 года', ST_SetSRID(ST_MakePoint(60.59734, 56.837982), 4326), '48', 5),
('48.267', 'Геологическая', ST_SetSRID(ST_MakePoint(60.603754, 56.826715), 4326), '48', 6),
('48.269', 'Чкаловская', ST_SetSRID(ST_MakePoint(60.610698, 56.808502), 4326), '48', 8),
('48.270', 'Ботаническая', ST_SetSRID(ST_MakePoint(60.633362, 56.797487), 4326), '48', 9);





-- Вставка города Казань
INSERT INTO cities (id, name) 
VALUES (88, 'Казань')
ON CONFLICT (id) DO NOTHING;

-- Вставка линии Центральная
INSERT INTO lines (id, name, hex_color, city_id) 
VALUES ('49', 'Центральная', 'CD0505', 88)
ON CONFLICT (id) DO NOTHING;

-- Вставка станций линии Центральная
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('49.462', 'Авиастроительная', ST_SetSRID(ST_MakePoint(49.081403, 55.828897), 4326), '49', 0),
('49.461', 'Северный вокзал', ST_SetSRID(ST_MakePoint(49.081778, 55.841519), 4326), '49', 1),
('49.460', 'Яшьлек (Юность)', ST_SetSRID(ST_MakePoint(49.082905, 55.827843), 4326), '49', 2),
('49.271', 'Козья слобода', ST_SetSRID(ST_MakePoint(49.097646, 55.817608), 4326), '49', 3),
('49.272', 'Кремлевская', ST_SetSRID(ST_MakePoint(49.105426, 55.795206), 4326), '49', 4),
('49.273', 'Площадь Тукая', ST_SetSRID(ST_MakePoint(49.122126, 55.787163), 4326), '49', 5),
('49.274', 'Суконная слобода', ST_SetSRID(ST_MakePoint(49.142275, 55.777094), 4326), '49', 6),
('49.275', 'Аметьево', ST_SetSRID(ST_MakePoint(49.165083, 55.765346), 4326), '49', 7),
('49.276', 'Горки', ST_SetSRID(ST_MakePoint(49.189679, 55.760763), 4326), '49', 8),
('49.277', 'Проспект Победы', ST_SetSRID(ST_MakePoint(49.207735, 55.750109), 4326), '49', 9),
('49.640', 'Дубравная', ST_SetSRID(ST_MakePoint(49.2197, 55.7425), 4326), '49', 10);





-- Вставка города Нижний Новгород
INSERT INTO cities (id, name) 
VALUES (66, 'Нижний Новгород')
ON CONFLICT (id) DO NOTHING;

-- Вставка линии Автозаводская
INSERT INTO lines (id, name, hex_color, city_id) 
VALUES ('50', 'Автозаводская', 'D80707', 66)
ON CONFLICT (id) DO NOTHING;

-- Вставка станций линии Автозаводская
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('50.278', 'Горьковская', ST_SetSRID(ST_MakePoint(43.99482, 56.313933), 4326), '50', 0),
('50.279', 'Московская', ST_SetSRID(ST_MakePoint(43.945799, 56.321097), 4326), '50', 1),
('50.280', 'Чкаловская', ST_SetSRID(ST_MakePoint(43.936933, 56.310637), 4326), '50', 2),
('50.281', 'Ленинская', ST_SetSRID(ST_MakePoint(43.937328, 56.297798), 4326), '50', 3),
('50.282', 'Заречная', ST_SetSRID(ST_MakePoint(43.927528, 56.285144), 4326), '50', 4),
('50.283', 'Двигатель Революции', ST_SetSRID(ST_MakePoint(43.922012, 56.277093), 4326), '50', 5),
('50.284', 'Пролетарская', ST_SetSRID(ST_MakePoint(43.914143, 56.266922), 4326), '50', 6),
('50.285', 'Автозаводская', ST_SetSRID(ST_MakePoint(43.902357, 56.257243), 4326), '50', 7),
('50.286', 'Комсомольская', ST_SetSRID(ST_MakePoint(43.889888, 56.252662), 4326), '50', 8),
('50.287', 'Кировская', ST_SetSRID(ST_MakePoint(43.876719, 56.247426), 4326), '50', 9),
('50.288', 'Парк Культуры', ST_SetSRID(ST_MakePoint(43.85816, 56.242034), 4326), '50', 10);

-- Вставка линии Сормовская
INSERT INTO lines (id, name, hex_color, city_id) 
VALUES ('51', 'Сормовская', '0071BC', 66)
ON CONFLICT (id) DO NOTHING;

-- Вставка станций линии Сормовская
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('51.606', 'Стрелка', ST_SetSRID(ST_MakePoint(43.9597, 56.3343), 4326), '51', 0),
('51.289', 'Московская', ST_SetSRID(ST_MakePoint(43.945799, 56.321097), 4326), '51', 1),
('51.290', 'Канавинская', ST_SetSRID(ST_MakePoint(43.927438, 56.320273), 4326), '51', 2),
('51.291', 'Бурнаковская', ST_SetSRID(ST_MakePoint(43.911897, 56.325704), 4326), '51', 3),
('51.292', 'Буревестник', ST_SetSRID(ST_MakePoint(43.892799, 56.333834), 4326), '51', 4);





-- Вставка города Новосибирск
INSERT INTO cities (id, name) 
VALUES (4, 'Новосибирск')
ON CONFLICT (id) DO NOTHING;

-- Вставка линии Ленинская
INSERT INTO lines (id, name, hex_color, city_id) 
VALUES ('52', 'Ленинская', 'CD0505', 4)
ON CONFLICT (id) DO NOTHING;

-- Вставка станций линии Ленинская
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('52.294', 'Заельцовская', ST_SetSRID(ST_MakePoint(82.912569, 55.059291), 4326), '52', 0),
('52.295', 'Гагаринская', ST_SetSRID(ST_MakePoint(82.91477, 55.051071), 4326), '52', 1),
('52.296', 'Красный проспект', ST_SetSRID(ST_MakePoint(82.917447, 55.040998), 4326), '52', 2),
('52.297', 'Площадь Ленина', ST_SetSRID(ST_MakePoint(82.92069, 55.029941), 4326), '52', 3),
('52.298', 'Октябрьская', ST_SetSRID(ST_MakePoint(82.939007, 55.018789), 4326), '52', 4),
('52.299', 'Речной вокзал', ST_SetSRID(ST_MakePoint(82.93827, 55.008738), 4326), '52', 5),
('52.300', 'Студенческая', ST_SetSRID(ST_MakePoint(82.906631, 54.989089), 4326), '52', 6),
('52.301', 'Площадь Маркса', ST_SetSRID(ST_MakePoint(82.89313, 54.982931), 4326), '52', 7);

-- Вставка линии Дзержинская
INSERT INTO lines (id, name, hex_color, city_id) 
VALUES ('53', 'Дзержинская', '0A6F20', 4)
ON CONFLICT (id) DO NOTHING;

-- Вставка станций линии Дзержинская
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('53.302', 'Площадь Гарина-Михайловского', ST_SetSRID(ST_MakePoint(82.897783, 55.035947), 4326), '53', 0),
('53.303', 'Сибирская', ST_SetSRID(ST_MakePoint(82.919172, 55.042163), 4326), '53', 1),
('53.304', 'Маршала Покрышкина', ST_SetSRID(ST_MakePoint(82.935566, 55.043634), 4326), '53', 2),
('53.305', 'Березовая роща', ST_SetSRID(ST_MakePoint(82.952913, 55.043242), 4326), '53', 3),
('53.306', 'Золотая нива', ST_SetSRID(ST_MakePoint(82.976044, 55.037928), 4326), '53', 4);






-- Вставка города Самара
INSERT INTO cities (id, name) 
VALUES (78, 'Самара')
ON CONFLICT (id) DO NOTHING;

-- Вставка линии Первая
INSERT INTO lines (id, name, hex_color, city_id) 
VALUES ('54', 'Первая', 'CD0505', 78)
ON CONFLICT (id) DO NOTHING;

-- Вставка станций линии Первая
INSERT INTO stations (id, name, location, line_id, station_order) VALUES
('54.509', 'Алабинская', ST_SetSRID(ST_MakePoint(50.134417, 53.209689), 4326), '54', 0),
('54.307', 'Российская', ST_SetSRID(ST_MakePoint(50.15022, 53.211385), 4326), '54', 1),
('54.308', 'Московская', ST_SetSRID(ST_MakePoint(50.159832, 53.203791), 4326), '54', 2),
('54.309', 'Гагаринская', ST_SetSRID(ST_MakePoint(50.176595, 53.200442), 4326), '54', 3),
('54.310', 'Спортивная', ST_SetSRID(ST_MakePoint(50.199286, 53.201121), 4326), '54', 4),
('54.311', 'Советская', ST_SetSRID(ST_MakePoint(50.220657, 53.201736), 4326), '54', 5),
('54.312', 'Победа', ST_SetSRID(ST_MakePoint(50.236414, 53.207313), 4326), '54', 6),
('54.313', 'Безымянка', ST_SetSRID(ST_MakePoint(50.248891, 53.212997), 4326), '54', 7),
('54.314', 'Кировская', ST_SetSRID(ST_MakePoint(50.269777, 53.211352), 4326), '54', 8),
('54.315', 'Юнгородок', ST_SetSRID(ST_MakePoint(50.282982, 53.212701), 4326), '54', 9);